GopalSaraf/Practicals/PSDL/include/proc/pic16lf1566.inc
// Register: PWM2CON
#define PWM2CON PWM2CON
PWM2CON                                  equ 0616h
// bitfield definitions
PWM2CON_PWM2POL_POSN                     equ 0004h
PWM2CON_PWM2POL_POSITION                 equ 0004h
PWM2CON_PWM2POL_SIZE                     equ 0001h
PWM2CON_PWM2POL_LENGTH                   equ 0001h
PWM2CON_PWM2POL_MASK                     equ 0010h
PWM2CON_PWM2OUT_POSN                     equ 0005h
PWM2CON_PWM2OUT_POSITION                 equ 0005h
PWM2CON_PWM2OUT_SIZE                     equ 0001h
PWM2CON_PWM2OUT_LENGTH                   equ 0001h
PWM2CON_PWM2OUT_MASK                     equ 0020h
PWM2CON_PWM2OE_POSN                      equ 0006h
PWM2CON_PWM2OE_POSITION                  equ 0006h
PWM2CON_PWM2OE_SIZE                      equ 0001h
PWM2CON_PWM2OE_LENGTH                    equ 0001h
PWM2CON_PWM2OE_MASK                      equ 0040h
PWM2CON_PWM2EN_POSN                      equ 0007h
PWM2CON_PWM2EN_POSITION                  equ 0007h
PWM2CON_PWM2EN_SIZE                      equ 0001h
PWM2CON_PWM2EN_LENGTH                    equ 0001h
PWM2CON_PWM2EN_MASK                      equ 0080h

// Register: PWMTMRS
#define PWMTMRS PWMTMRS
PWMTMRS                                  equ 061Dh
// bitfield definitions
PWMTMRS_P1TSEL_POSN                      equ 0000h
PWMTMRS_P1TSEL_POSITION                  equ 0000h
PWMTMRS_P1TSEL_SIZE                      equ 0001h
PWMTMRS_P1TSEL_LENGTH                    equ 0001h
PWMTMRS_P1TSEL_MASK                      equ 0001h
PWMTMRS_P2TSEL_POSN                      equ 0002h
PWMTMRS_P2TSEL_POSITION                  equ 0002h
PWMTMRS_P2TSEL_SIZE                      equ 0001h
PWMTMRS_P2TSEL_LENGTH                    equ 0001h
PWMTMRS_P2TSEL_MASK                      equ 0004h

// Register: PWM1AOE
#define PWM1AOE PWM1AOE
PWM1AOE                                  equ 061Eh
// bitfield definitions
PWM1AOE_PWM1OE_POSN                      equ 0000h
PWM1AOE_PWM1OE_POSITION                  equ 0000h
PWM1AOE_PWM1OE_SIZE                      equ 0004h
PWM1AOE_PWM1OE_LENGTH                    equ 0004h
PWM1AOE_PWM1OE_MASK                      equ 000Fh
PWM1AOE_PWM1OE0_POSN                     equ 0000h
PWM1AOE_PWM1OE0_POSITION                 equ 0000h
PWM1AOE_PWM1OE0_SIZE                     equ 0001h
PWM1AOE_PWM1OE0_LENGTH                   equ 0001h
PWM1AOE_PWM1OE0_MASK                     equ 0001h
PWM1AOE_PWM1OE1_POSN                     equ 0001h
PWM1AOE_PWM1OE1_POSITION                 equ 0001h
PWM1AOE_PWM1OE1_SIZE                     equ 0001h
PWM1AOE_PWM1OE1_LENGTH                   equ 0001h
PWM1AOE_PWM1OE1_MASK                     equ 0002h
PWM1AOE_PWM1OE2_POSN                     equ 0002h
PWM1AOE_PWM1OE2_POSITION                 equ 0002h
PWM1AOE_PWM1OE2_SIZE                     equ 0001h
PWM1AOE_PWM1OE2_LENGTH                   equ 0001h
PWM1AOE_PWM1OE2_MASK                     equ 0004h
PWM1AOE_PWM1OE3_POSN                     equ 0003h
PWM1AOE_PWM1OE3_POSITION                 equ 0003h
PWM1AOE_PWM1OE3_SIZE                     equ 0001h
PWM1AOE_PWM1OE3_LENGTH                   equ 0001h
PWM1AOE_PWM1OE3_MASK                     equ 0008h

// Register: PWM2AOE
#define PWM2AOE PWM2AOE
PWM2AOE                                  equ 061Fh
// bitfield definitions
PWM2AOE_PWM2OE_POSN                      equ 0000h
PWM2AOE_PWM2OE_POSITION                  equ 0000h
PWM2AOE_PWM2OE_SIZE                      equ 0004h
PWM2AOE_PWM2OE_LENGTH                    equ 0004h
PWM2AOE_PWM2OE_MASK                      equ 000Fh
PWM2AOE_PWM2OE0_POSN                     equ 0000h
PWM2AOE_PWM2OE0_POSITION                 equ 0000h
PWM2AOE_PWM2OE0_SIZE                     equ 0001h
PWM2AOE_PWM2OE0_LENGTH                   equ 0001h
PWM2AOE_PWM2OE0_MASK                     equ 0001h
PWM2AOE_PWM2OE1_POSN                     equ 0001h
PWM2AOE_PWM2OE1_POSITION                 equ 0001h
PWM2AOE_PWM2OE1_SIZE                     equ 0001h
PWM2AOE_PWM2OE1_LENGTH                   equ 0001h
PWM2AOE_PWM2OE1_MASK                     equ 0002h
PWM2AOE_PWM2OE2_POSN                     equ 0002h
PWM2AOE_PWM2OE2_POSITION                 equ 0002h
PWM2AOE_PWM2OE2_SIZE                     equ 0001h
PWM2AOE_PWM2OE2_LENGTH                   equ 0001h
PWM2AOE_PWM2OE2_MASK                     equ 0004h
PWM2AOE_PWM2OE3_POSN                     equ 0003h
PWM2AOE_PWM2OE3_POSITION                 equ 0003h
PWM2AOE_PWM2OE3_SIZE                     equ 0001h
PWM2AOE_PWM2OE3_LENGTH                   equ 0001h
PWM2AOE_PWM2OE3_MASK                     equ 0008h

// Register: ADCTX
#define ADCTX ADCTX
ADCTX                                    equ 0691h
// bitfield definitions
ADCTX_A1TX0_POSN                         equ 0000h
ADCTX_A1TX0_POSITION                     equ 0000h
ADCTX_A1TX0_SIZE                         equ 0001h
ADCTX_A1TX0_LENGTH                       equ 0001h
ADCTX_A1TX0_MASK                         equ 0001h
ADCTX_A1TX1_POSN                         equ 0001h
ADCTX_A1TX1_POSITION                     equ 0001h
ADCTX_A1TX1_SIZE                         equ 0001h
ADCTX_A1TX1_LENGTH                       equ 0001h
ADCTX_A1TX1_MASK                         equ 0002h
ADCTX_A1TX2_POSN                         equ 0002h
ADCTX_A1TX2_POSITION                     equ 0002h
ADCTX_A1TX2_SIZE                         equ 0001h
ADCTX_A1TX2_LENGTH                       equ 0001h
ADCTX_A1TX2_MASK                         equ 0004h
ADCTX_A2TX0_POSN                         equ 0004h
ADCTX_A2TX0_POSITION                     equ 0004h
ADCTX_A2TX0_SIZE                         equ 0001h
ADCTX_A2TX0_LENGTH                       equ 0001h
ADCTX_A2TX0_MASK                         equ 0010h
ADCTX_A2TX1_POSN                         equ 0005h
ADCTX_A2TX1_POSITION                     equ 0005h
ADCTX_A2TX1_SIZE                         equ 0001h
ADCTX_A2TX1_LENGTH                       equ 0001h
ADCTX_A2TX1_MASK                         equ 0020h
ADCTX_A2TX2_POSN                         equ 0006h
ADCTX_A2TX2_POSITION                     equ 0006h
ADCTX_A2TX2_SIZE                         equ 0001h
ADCTX_A2TX2_LENGTH                       equ 0001h
ADCTX_A2TX2_MASK                         equ 0040h

