GopalSaraf/Practicals/PSDL/include/proc/pic16lf1566.inc
// Register: AD2CON3
#define AD2CON3 AD2CON3
AD2CON3                                  equ 0794h
// bitfield definitions
AD2CON3_AD2DSEN_POSN                     equ 0000h
AD2CON3_AD2DSEN_POSITION                 equ 0000h
AD2CON3_AD2DSEN_SIZE                     equ 0001h
AD2CON3_AD2DSEN_LENGTH                   equ 0001h
AD2CON3_AD2DSEN_MASK                     equ 0001h
AD2CON3_AD2IPEN_POSN                     equ 0001h
AD2CON3_AD2IPEN_POSITION                 equ 0001h
AD2CON3_AD2IPEN_SIZE                     equ 0001h
AD2CON3_AD2IPEN_LENGTH                   equ 0001h
AD2CON3_AD2IPEN_MASK                     equ 0002h
AD2CON3_AD2IPPOL_POSN                    equ 0006h
AD2CON3_AD2IPPOL_POSITION                equ 0006h
AD2CON3_AD2IPPOL_SIZE                    equ 0001h
AD2CON3_AD2IPPOL_LENGTH                  equ 0001h
AD2CON3_AD2IPPOL_MASK                    equ 0040h
AD2CON3_AD2EPPOL_POSN                    equ 0007h
AD2CON3_AD2EPPOL_POSITION                equ 0007h
AD2CON3_AD2EPPOL_SIZE                    equ 0001h
AD2CON3_AD2EPPOL_LENGTH                  equ 0001h
AD2CON3_AD2EPPOL_MASK                    equ 0080h
AD2CON3_ADDSEN_POSN                      equ 0000h
AD2CON3_ADDSEN_POSITION                  equ 0000h
AD2CON3_ADDSEN_SIZE                      equ 0001h
AD2CON3_ADDSEN_LENGTH                    equ 0001h
AD2CON3_ADDSEN_MASK                      equ 0001h
AD2CON3_ADIPEN_POSN                      equ 0001h
AD2CON3_ADIPEN_POSITION                  equ 0001h
AD2CON3_ADIPEN_SIZE                      equ 0001h
AD2CON3_ADIPEN_LENGTH                    equ 0001h
AD2CON3_ADIPEN_MASK                      equ 0002h
AD2CON3_ADIPPOL_POSN                     equ 0006h
AD2CON3_ADIPPOL_POSITION                 equ 0006h
AD2CON3_ADIPPOL_SIZE                     equ 0001h
AD2CON3_ADIPPOL_LENGTH                   equ 0001h
AD2CON3_ADIPPOL_MASK                     equ 0040h
AD2CON3_ADEPPOL_POSN                     equ 0007h
AD2CON3_ADEPPOL_POSITION                 equ 0007h
AD2CON3_ADEPPOL_SIZE                     equ 0001h
AD2CON3_ADEPPOL_LENGTH                   equ 0001h
AD2CON3_ADEPPOL_MASK                     equ 0080h

// Register: AD2PRECON
#define AD2PRECON AD2PRECON
AD2PRECON                                equ 0796h
// bitfield definitions
AD2PRECON_ADPRE_POSN                     equ 0000h
AD2PRECON_ADPRE_POSITION                 equ 0000h
AD2PRECON_ADPRE_SIZE                     equ 0007h
AD2PRECON_ADPRE_LENGTH                   equ 0007h
AD2PRECON_ADPRE_MASK                     equ 007Fh
AD2PRECON_ADPRE0_POSN                    equ 0000h
AD2PRECON_ADPRE0_POSITION                equ 0000h
AD2PRECON_ADPRE0_SIZE                    equ 0001h
AD2PRECON_ADPRE0_LENGTH                  equ 0001h
AD2PRECON_ADPRE0_MASK                    equ 0001h
AD2PRECON_ADPRE1_POSN                    equ 0001h
AD2PRECON_ADPRE1_POSITION                equ 0001h
AD2PRECON_ADPRE1_SIZE                    equ 0001h
AD2PRECON_ADPRE1_LENGTH                  equ 0001h
AD2PRECON_ADPRE1_MASK                    equ 0002h
AD2PRECON_ADPRE2_POSN                    equ 0002h
AD2PRECON_ADPRE2_POSITION                equ 0002h
AD2PRECON_ADPRE2_SIZE                    equ 0001h
AD2PRECON_ADPRE2_LENGTH                  equ 0001h
AD2PRECON_ADPRE2_MASK                    equ 0004h
AD2PRECON_ADPRE3_POSN                    equ 0003h
AD2PRECON_ADPRE3_POSITION                equ 0003h
AD2PRECON_ADPRE3_SIZE                    equ 0001h
AD2PRECON_ADPRE3_LENGTH                  equ 0001h
AD2PRECON_ADPRE3_MASK                    equ 0008h
AD2PRECON_ADPRE4_POSN                    equ 0004h
AD2PRECON_ADPRE4_POSITION                equ 0004h
AD2PRECON_ADPRE4_SIZE                    equ 0001h
AD2PRECON_ADPRE4_LENGTH                  equ 0001h
AD2PRECON_ADPRE4_MASK                    equ 0010h
AD2PRECON_ADPRE5_POSN                    equ 0005h
AD2PRECON_ADPRE5_POSITION                equ 0005h
AD2PRECON_ADPRE5_SIZE                    equ 0001h
AD2PRECON_ADPRE5_LENGTH                  equ 0001h
AD2PRECON_ADPRE5_MASK                    equ 0020h
AD2PRECON_ADPRE6_POSN                    equ 0006h
AD2PRECON_ADPRE6_POSITION                equ 0006h
AD2PRECON_ADPRE6_SIZE                    equ 0001h
AD2PRECON_ADPRE6_LENGTH                  equ 0001h
AD2PRECON_ADPRE6_MASK                    equ 0040h

// Register: AD2ACQCON
#define AD2ACQCON AD2ACQCON
AD2ACQCON                                equ 0797h
// bitfield definitions
AD2ACQCON_ADACQ_POSN                     equ 0000h
AD2ACQCON_ADACQ_POSITION                 equ 0000h
AD2ACQCON_ADACQ_SIZE                     equ 0007h
AD2ACQCON_ADACQ_LENGTH                   equ 0007h
AD2ACQCON_ADACQ_MASK                     equ 007Fh
AD2ACQCON_ADACQ0_POSN                    equ 0000h
AD2ACQCON_ADACQ0_POSITION                equ 0000h
AD2ACQCON_ADACQ0_SIZE                    equ 0001h
AD2ACQCON_ADACQ0_LENGTH                  equ 0001h
AD2ACQCON_ADACQ0_MASK                    equ 0001h
AD2ACQCON_ADACQ1_POSN                    equ 0001h
AD2ACQCON_ADACQ1_POSITION                equ 0001h
AD2ACQCON_ADACQ1_SIZE                    equ 0001h
AD2ACQCON_ADACQ1_LENGTH                  equ 0001h
AD2ACQCON_ADACQ1_MASK                    equ 0002h
AD2ACQCON_ADACQ2_POSN                    equ 0002h
AD2ACQCON_ADACQ2_POSITION                equ 0002h
AD2ACQCON_ADACQ2_SIZE                    equ 0001h
AD2ACQCON_ADACQ2_LENGTH                  equ 0001h
AD2ACQCON_ADACQ2_MASK                    equ 0004h
AD2ACQCON_ADACQ3_POSN                    equ 0003h
AD2ACQCON_ADACQ3_POSITION                equ 0003h
AD2ACQCON_ADACQ3_SIZE                    equ 0001h
AD2ACQCON_ADACQ3_LENGTH                  equ 0001h
AD2ACQCON_ADACQ3_MASK                    equ 0008h
AD2ACQCON_ADACQ4_POSN                    equ 0004h
AD2ACQCON_ADACQ4_POSITION                equ 0004h
AD2ACQCON_ADACQ4_SIZE                    equ 0001h
AD2ACQCON_ADACQ4_LENGTH                  equ 0001h
AD2ACQCON_ADACQ4_MASK                    equ 0010h
AD2ACQCON_ADACQ5_POSN                    equ 0005h
AD2ACQCON_ADACQ5_POSITION                equ 0005h
AD2ACQCON_ADACQ5_SIZE                    equ 0001h
AD2ACQCON_ADACQ5_LENGTH                  equ 0001h
AD2ACQCON_ADACQ5_MASK                    equ 0020h
AD2ACQCON_ADACQ6_POSN                    equ 0006h
AD2ACQCON_ADACQ6_POSITION                equ 0006h
AD2ACQCON_ADACQ6_SIZE                    equ 0001h
AD2ACQCON_ADACQ6_LENGTH                  equ 0001h
AD2ACQCON_ADACQ6_MASK                    equ 0040h

