GopalSaraf/Practicals/PSDL/include/proc/pic16lf1566.inc
// Register: AD2CH1
#define AD2CH1 AD2CH1
AD2CH1                                   equ 079Fh
// bitfield definitions
AD2CH1_CH28_POSN                         equ 0000h
AD2CH1_CH28_POSITION                     equ 0000h
AD2CH1_CH28_SIZE                         equ 0001h
AD2CH1_CH28_LENGTH                       equ 0001h
AD2CH1_CH28_MASK                         equ 0001h
AD2CH1_CH29_POSN                         equ 0001h
AD2CH1_CH29_POSITION                     equ 0001h
AD2CH1_CH29_SIZE                         equ 0001h
AD2CH1_CH29_LENGTH                       equ 0001h
AD2CH1_CH29_MASK                         equ 0002h
AD2CH1_CH40_POSN                         equ 0002h
AD2CH1_CH40_POSITION                     equ 0002h
AD2CH1_CH40_SIZE                         equ 0001h
AD2CH1_CH40_LENGTH                       equ 0001h
AD2CH1_CH40_MASK                         equ 0004h

// Register: ICDIO
#define ICDIO ICDIO
ICDIO                                    equ 0F8Ch
// bitfield definitions
ICDIO_TRIS_ICDCLK_POSN                   equ 0002h
ICDIO_TRIS_ICDCLK_POSITION               equ 0002h
ICDIO_TRIS_ICDCLK_SIZE                   equ 0001h
ICDIO_TRIS_ICDCLK_LENGTH                 equ 0001h
ICDIO_TRIS_ICDCLK_MASK                   equ 0004h
ICDIO_TRIS_ICDDAT_POSN                   equ 0003h
ICDIO_TRIS_ICDDAT_POSITION               equ 0003h
ICDIO_TRIS_ICDDAT_SIZE                   equ 0001h
ICDIO_TRIS_ICDDAT_LENGTH                 equ 0001h
ICDIO_TRIS_ICDDAT_MASK                   equ 0008h
ICDIO_LAT_ICDCLK_POSN                    equ 0004h
ICDIO_LAT_ICDCLK_POSITION                equ 0004h
ICDIO_LAT_ICDCLK_SIZE                    equ 0001h
ICDIO_LAT_ICDCLK_LENGTH                  equ 0001h
ICDIO_LAT_ICDCLK_MASK                    equ 0010h
ICDIO_LAT_ICDDAT_POSN                    equ 0005h
ICDIO_LAT_ICDDAT_POSITION                equ 0005h
ICDIO_LAT_ICDDAT_SIZE                    equ 0001h
ICDIO_LAT_ICDDAT_LENGTH                  equ 0001h
ICDIO_LAT_ICDDAT_MASK                    equ 0020h
ICDIO_PORT_ICDCLK_POSN                   equ 0006h
ICDIO_PORT_ICDCLK_POSITION               equ 0006h
ICDIO_PORT_ICDCLK_SIZE                   equ 0001h
ICDIO_PORT_ICDCLK_LENGTH                 equ 0001h
ICDIO_PORT_ICDCLK_MASK                   equ 0040h
ICDIO_PORT_ICDDAT_POSN                   equ 0007h
ICDIO_PORT_ICDDAT_POSITION               equ 0007h
ICDIO_PORT_ICDDAT_SIZE                   equ 0001h
ICDIO_PORT_ICDDAT_LENGTH                 equ 0001h
ICDIO_PORT_ICDDAT_MASK                   equ 0080h

// Register: ICDCON0
#define ICDCON0 ICDCON0
ICDCON0                                  equ 0F8Dh
// bitfield definitions
ICDCON0_RSTVEC_POSN                      equ 0000h
ICDCON0_RSTVEC_POSITION                  equ 0000h
ICDCON0_RSTVEC_SIZE                      equ 0001h
ICDCON0_RSTVEC_LENGTH                    equ 0001h
ICDCON0_RSTVEC_MASK                      equ 0001h
ICDCON0_DBGINEX_POSN                     equ 0003h
ICDCON0_DBGINEX_POSITION                 equ 0003h
ICDCON0_DBGINEX_SIZE                     equ 0001h
ICDCON0_DBGINEX_LENGTH                   equ 0001h
ICDCON0_DBGINEX_MASK                     equ 0008h
ICDCON0_SSTEP_POSN                       equ 0005h
ICDCON0_SSTEP_POSITION                   equ 0005h
ICDCON0_SSTEP_SIZE                       equ 0001h
ICDCON0_SSTEP_LENGTH                     equ 0001h
ICDCON0_SSTEP_MASK                       equ 0020h
ICDCON0_FREEZ_POSN                       equ 0006h
ICDCON0_FREEZ_POSITION                   equ 0006h
ICDCON0_FREEZ_SIZE                       equ 0001h
ICDCON0_FREEZ_LENGTH                     equ 0001h
ICDCON0_FREEZ_MASK                       equ 0040h
ICDCON0_INBUG_POSN                       equ 0007h
ICDCON0_INBUG_POSITION                   equ 0007h
ICDCON0_INBUG_SIZE                       equ 0001h
ICDCON0_INBUG_LENGTH                     equ 0001h
ICDCON0_INBUG_MASK                       equ 0080h

// Register: ICDSTAT
#define ICDSTAT ICDSTAT
ICDSTAT                                  equ 0F91h
// bitfield definitions
ICDSTAT_USRHLTF_POSN                     equ 0001h
ICDSTAT_USRHLTF_POSITION                 equ 0001h
ICDSTAT_USRHLTF_SIZE                     equ 0001h
ICDSTAT_USRHLTF_LENGTH                   equ 0001h
ICDSTAT_USRHLTF_MASK                     equ 0002h
ICDSTAT_TRP0HLTF_POSN                    equ 0006h
ICDSTAT_TRP0HLTF_POSITION                equ 0006h
ICDSTAT_TRP0HLTF_SIZE                    equ 0001h
ICDSTAT_TRP0HLTF_LENGTH                  equ 0001h
ICDSTAT_TRP0HLTF_MASK                    equ 0040h
ICDSTAT_TRP1HLTF_POSN                    equ 0007h
ICDSTAT_TRP1HLTF_POSITION                equ 0007h
ICDSTAT_TRP1HLTF_SIZE                    equ 0001h
ICDSTAT_TRP1HLTF_LENGTH                  equ 0001h
ICDSTAT_TRP1HLTF_MASK                    equ 0080h

// Register: ICDINSTL
#define ICDINSTL ICDINSTL
ICDINSTL                                 equ 0F96h
// bitfield definitions
ICDINSTL_DBGIN0_POSN                     equ 0000h
ICDINSTL_DBGIN0_POSITION                 equ 0000h
ICDINSTL_DBGIN0_SIZE                     equ 0001h
ICDINSTL_DBGIN0_LENGTH                   equ 0001h
ICDINSTL_DBGIN0_MASK                     equ 0001h
ICDINSTL_DBGIN1_POSN                     equ 0001h
ICDINSTL_DBGIN1_POSITION                 equ 0001h
ICDINSTL_DBGIN1_SIZE                     equ 0001h
ICDINSTL_DBGIN1_LENGTH                   equ 0001h
ICDINSTL_DBGIN1_MASK                     equ 0002h
ICDINSTL_DBGIN2_POSN                     equ 0002h
ICDINSTL_DBGIN2_POSITION                 equ 0002h
ICDINSTL_DBGIN2_SIZE                     equ 0001h
ICDINSTL_DBGIN2_LENGTH                   equ 0001h
ICDINSTL_DBGIN2_MASK                     equ 0004h
ICDINSTL_DBGIN3_POSN                     equ 0003h
ICDINSTL_DBGIN3_POSITION                 equ 0003h
ICDINSTL_DBGIN3_SIZE                     equ 0001h
ICDINSTL_DBGIN3_LENGTH                   equ 0001h
ICDINSTL_DBGIN3_MASK                     equ 0008h
ICDINSTL_DBGIN4_POSN                     equ 0004h
ICDINSTL_DBGIN4_POSITION                 equ 0004h
ICDINSTL_DBGIN4_SIZE                     equ 0001h
ICDINSTL_DBGIN4_LENGTH                   equ 0001h
ICDINSTL_DBGIN4_MASK                     equ 0010h
ICDINSTL_DBGIN5_POSN                     equ 0005h
ICDINSTL_DBGIN5_POSITION                 equ 0005h
ICDINSTL_DBGIN5_SIZE                     equ 0001h
ICDINSTL_DBGIN5_LENGTH                   equ 0001h
ICDINSTL_DBGIN5_MASK                     equ 0020h
ICDINSTL_DBGIN6_POSN                     equ 0006h
ICDINSTL_DBGIN6_POSITION                 equ 0006h
ICDINSTL_DBGIN6_SIZE                     equ 0001h
ICDINSTL_DBGIN6_LENGTH                   equ 0001h
ICDINSTL_DBGIN6_MASK                     equ 0040h
ICDINSTL_DBGIN7_POSN                     equ 0007h
ICDINSTL_DBGIN7_POSITION                 equ 0007h
ICDINSTL_DBGIN7_SIZE                     equ 0001h
ICDINSTL_DBGIN7_LENGTH                   equ 0001h
ICDINSTL_DBGIN7_MASK                     equ 0080h

// Register: ICDINSTH
#define ICDINSTH ICDINSTH
ICDINSTH                                 equ 0F97h
// bitfield definitions
ICDINSTH_DBGIN8_POSN                     equ 0000h
ICDINSTH_DBGIN8_POSITION                 equ 0000h
ICDINSTH_DBGIN8_SIZE                     equ 0001h
ICDINSTH_DBGIN8_LENGTH                   equ 0001h
ICDINSTH_DBGIN8_MASK                     equ 0001h
ICDINSTH_DBGIN9_POSN                     equ 0001h
ICDINSTH_DBGIN9_POSITION                 equ 0001h
ICDINSTH_DBGIN9_SIZE                     equ 0001h
ICDINSTH_DBGIN9_LENGTH                   equ 0001h
ICDINSTH_DBGIN9_MASK                     equ 0002h
ICDINSTH_DBGIN10_POSN                    equ 0002h
ICDINSTH_DBGIN10_POSITION                equ 0002h
ICDINSTH_DBGIN10_SIZE                    equ 0001h
ICDINSTH_DBGIN10_LENGTH                  equ 0001h
ICDINSTH_DBGIN10_MASK                    equ 0004h
ICDINSTH_DBGIN11_POSN                    equ 0003h
ICDINSTH_DBGIN11_POSITION                equ 0003h
ICDINSTH_DBGIN11_SIZE                    equ 0001h
ICDINSTH_DBGIN11_LENGTH                  equ 0001h
ICDINSTH_DBGIN11_MASK                    equ 0008h
ICDINSTH_DBGIN12_POSN                    equ 0004h
ICDINSTH_DBGIN12_POSITION                equ 0004h
ICDINSTH_DBGIN12_SIZE                    equ 0001h
ICDINSTH_DBGIN12_LENGTH                  equ 0001h
ICDINSTH_DBGIN12_MASK                    equ 0010h
ICDINSTH_DBGIN13_POSN                    equ 0005h
ICDINSTH_DBGIN13_POSITION                equ 0005h
ICDINSTH_DBGIN13_SIZE                    equ 0001h
ICDINSTH_DBGIN13_LENGTH                  equ 0001h
ICDINSTH_DBGIN13_MASK                    equ 0020h

// Register: ICDBK0CON
#define ICDBK0CON ICDBK0CON
ICDBK0CON                                equ 0F9Ch
// bitfield definitions
ICDBK0CON_BKHLT_POSN                     equ 0000h
ICDBK0CON_BKHLT_POSITION                 equ 0000h
ICDBK0CON_BKHLT_SIZE                     equ 0001h
ICDBK0CON_BKHLT_LENGTH                   equ 0001h
ICDBK0CON_BKHLT_MASK                     equ 0001h
ICDBK0CON_BKEN_POSN                      equ 0007h
ICDBK0CON_BKEN_POSITION                  equ 0007h
ICDBK0CON_BKEN_SIZE                      equ 0001h
ICDBK0CON_BKEN_LENGTH                    equ 0001h
ICDBK0CON_BKEN_MASK                      equ 0080h

