GopalSaraf/Practicals/PSDL/include/proc/pic16lf1566.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define A1TX0                            BANKMASK(ADCTX), 0
#define A1TX1                            BANKMASK(ADCTX), 1
#define A1TX2                            BANKMASK(ADCTX), 2
#define A2TX0                            BANKMASK(ADCTX), 4
#define A2TX1                            BANKMASK(ADCTX), 5
#define A2TX2                            BANKMASK(ADCTX), 6
#define ABDEN                            BANKMASK(BAUDCON), 0
#define ABDOVF                           BANKMASK(BAUDCON), 7
#define AD1CONV                          BANKMASK(ADSTAT), 2
#define AD1DSEN                          BANKMASK(AD1CON3), 0
#define AD1EPPOL                         BANKMASK(AD1CON3), 7
#define AD1IE                            BANKMASK(PIE1), 6
#define AD1IF                            BANKMASK(PIR1), 6
#define AD1IPEN                          BANKMASK(AD1CON3), 1
#define AD1IPPOL                         BANKMASK(AD1CON3), 6
#define AD1STG0                          BANKMASK(ADSTAT), 0
#define AD1STG1                          BANKMASK(ADSTAT), 1
#define AD2CONV                          BANKMASK(ADSTAT), 6
#define AD2DSEN                          BANKMASK(AD2CON3), 0
#define AD2EPPOL                         BANKMASK(AD2CON3), 7
#define AD2IE                            BANKMASK(PIE2), 6
#define AD2IF                            BANKMASK(PIR2), 6
#define AD2IPEN                          BANKMASK(AD2CON3), 1
#define AD2IPPOL                         BANKMASK(AD2CON3), 6
#define AD2ON                            BANKMASK(AD2CON0), 0
#define AD2STG0                          BANKMASK(ADSTAT), 4
#define AD2STG1                          BANKMASK(ADSTAT), 5
#define ADCONV                           BANKMASK(ADSTAT), 2
#define ADCS0                            BANKMASK(ADCOMCON), 4
#define ADCS1                            BANKMASK(ADCOMCON), 5
#define ADCS2                            BANKMASK(ADCOMCON), 6
#define ADDEN                            BANKMASK(RCSTA), 3
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGO                             BANKMASK(ADCON0), 1
#define ADIE                             BANKMASK(PIE1), 6
#define ADIF                             BANKMASK(PIR1), 6
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA3                            BANKMASK(ANSELA), 3
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSA5                            BANKMASK(ANSELA), 5
#define ANSA6                            BANKMASK(ANSELA), 6
#define ANSA7                            BANKMASK(ANSELA), 7
#define ANSB0                            BANKMASK(ANSELB), 0
#define ANSB1                            BANKMASK(ANSELB), 1
#define ANSB2                            BANKMASK(ANSELB), 2
#define ANSB3                            BANKMASK(ANSELB), 3
#define ANSB4                            BANKMASK(ANSELB), 4
#define ANSB5                            BANKMASK(ANSELB), 5
#define ANSB6                            BANKMASK(ANSELB), 6
#define ANSB7                            BANKMASK(ANSELB), 7
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define ANSC4                            BANKMASK(ANSELC), 4
#define ANSC5                            BANKMASK(ANSELC), 5
#define ANSC6                            BANKMASK(ANSELC), 6
#define ANSC7                            BANKMASK(ANSELC), 7
#define BCL1IE                           BANKMASK(PIE2), 3
#define BCL1IF                           BANKMASK(PIR2), 3
#define BCL2IE                           BANKMASK(PIE2), 2
#define BCL2IF                           BANKMASK(PIR2), 2
#define BKA0                             BANKMASK(ICDBK0L), 0
#define BKA1                             BANKMASK(ICDBK0L), 1
#define BKA10                            BANKMASK(ICDBK0H), 2
#define BKA11                            BANKMASK(ICDBK0H), 3
#define BKA12                            BANKMASK(ICDBK0H), 4
#define BKA13                            BANKMASK(ICDBK0H), 5
#define BKA14                            BANKMASK(ICDBK0H), 6
#define BKA2                             BANKMASK(ICDBK0L), 2
#define BKA3                             BANKMASK(ICDBK0L), 3
#define BKA4                             BANKMASK(ICDBK0L), 4
#define BKA5                             BANKMASK(ICDBK0L), 5
#define BKA6                             BANKMASK(ICDBK0L), 6
#define BKA7                             BANKMASK(ICDBK0L), 7
#define BKA8                             BANKMASK(ICDBK0H), 0
#define BKA9                             BANKMASK(ICDBK0H), 1
#define BKEN                             BANKMASK(ICDBK0CON), 7
#define BKHLT                            BANKMASK(ICDBK0CON), 0
#define BORFS                            BANKMASK(BORCON), 6
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUDCON), 3
#define BRGH                             BANKMASK(TXSTA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
#define BSR3                             BANKMASK(BSR), 3
#define BSR4                             BANKMASK(BSR), 4
#define CARRY                            BANKMASK(STATUS), 0
#define CFGS                             BANKMASK(PMCON1), 6
#define CH10                             BANKMASK(AD1CH0), 0
#define CH11                             BANKMASK(AD1CH0), 1
#define CH12                             BANKMASK(AD1CH0), 2
#define CH13                             BANKMASK(AD1CH0), 3
#define CH14                             BANKMASK(AD1CH0), 4
#define CH15                             BANKMASK(AD1CH0), 5
#define CH16                             BANKMASK(AD1CH0), 6
#define CH17                             BANKMASK(AD1CH0), 7
#define CH18                             BANKMASK(AD1CH1), 0
#define CH19                             BANKMASK(AD1CH1), 1
#define CH20                             BANKMASK(AD2CH0), 0
#define CH21                             BANKMASK(AD2CH0), 1
#define CH22                             BANKMASK(AD2CH0), 2
#define CH23                             BANKMASK(AD2CH0), 3
#define CH24                             BANKMASK(AD2CH0), 4
#define CH25                             BANKMASK(AD2CH0), 5
#define CH26                             BANKMASK(AD2CH0), 6
#define CH27                             BANKMASK(AD2CH0), 7
#define CH28                             BANKMASK(AD2CH1), 0
#define CH29                             BANKMASK(AD2CH1), 1
#define CH40                             BANKMASK(AD2CH1), 2
#define CHS17                            BANKMASK(AD1CH0), 7
#define CREN                             BANKMASK(RCSTA), 4
#define CSRC                             BANKMASK(TXSTA), 7
#define C_SHAD                           BANKMASK(STATUS_SHAD), 0
#define DBGIN0                           BANKMASK(ICDINSTL), 0
#define DBGIN1                           BANKMASK(ICDINSTL), 1
#define DBGIN10                          BANKMASK(ICDINSTH), 2
#define DBGIN11                          BANKMASK(ICDINSTH), 3
#define DBGIN12                          BANKMASK(ICDINSTH), 4
#define DBGIN13                          BANKMASK(ICDINSTH), 5
#define DBGIN2                           BANKMASK(ICDINSTL), 2
#define DBGIN3                           BANKMASK(ICDINSTL), 3
#define DBGIN4                           BANKMASK(ICDINSTL), 4
#define DBGIN5                           BANKMASK(ICDINSTL), 5
#define DBGIN6                           BANKMASK(ICDINSTL), 6
#define DBGIN7                           BANKMASK(ICDINSTL), 7
#define DBGIN8                           BANKMASK(ICDINSTH), 0
#define DBGIN9                           BANKMASK(ICDINSTH), 1
#define DBGINEX                          BANKMASK(ICDCON0), 3
#define DC                               BANKMASK(STATUS), 1
#define DC_SHAD                          BANKMASK(STATUS_SHAD), 1
#define FERR                             BANKMASK(RCSTA), 2
#define FREE                             BANKMASK(PMCON1), 4
#define FREEZ                            BANKMASK(ICDCON0), 6
#define FVREN                            BANKMASK(FVRCON), 7
#define FVRRDY                           BANKMASK(FVRCON), 6
#define GIE                              BANKMASK(INTCON), 7
#define GO_nDONE1                        BANKMASK(AD1CON0), 1
#define GO_nDONE2                        BANKMASK(AD2CON0), 1
#define GRD1AOE                          BANKMASK(AD1GRD), 6
#define GRD1BOE                          BANKMASK(AD1GRD), 7
#define GRD1POL                          BANKMASK(AD1GRD), 5
#define GRD2AOE                          BANKMASK(AD2GRD), 6
#define GRD2BOE                          BANKMASK(AD2GRD), 7
#define GRD2POL                          BANKMASK(AD2GRD), 5
#define GRDASEL                          BANKMASK(APFCON), 0
#define GRDBSEL                          BANKMASK(APFCON), 1
#define HFIOFR                           BANKMASK(OSCSTAT), 4
#define HFIOFS                           BANKMASK(OSCSTAT), 0
#define INBUG                            BANKMASK(ICDCON0), 7
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCBF0                           BANKMASK(IOCBF), 0
#define IOCBF1                           BANKMASK(IOCBF), 1
#define IOCBF2                           BANKMASK(IOCBF), 2
#define IOCBF3                           BANKMASK(IOCBF), 3
#define IOCBF4                           BANKMASK(IOCBF), 4
#define IOCBF5                           BANKMASK(IOCBF), 5
#define IOCBF6                           BANKMASK(IOCBF), 6
#define IOCBF7                           BANKMASK(IOCBF), 7
#define IOCBN0                           BANKMASK(IOCBN), 0
#define IOCBN1                           BANKMASK(IOCBN), 1
#define IOCBN2                           BANKMASK(IOCBN), 2
#define IOCBN3                           BANKMASK(IOCBN), 3
#define IOCBN4                           BANKMASK(IOCBN), 4
#define IOCBN5                           BANKMASK(IOCBN), 5
#define IOCBN6                           BANKMASK(IOCBN), 6
#define IOCBN7                           BANKMASK(IOCBN), 7
#define IOCBP0                           BANKMASK(IOCBP), 0
#define IOCBP1                           BANKMASK(IOCBP), 1
#define IOCBP2                           BANKMASK(IOCBP), 2
#define IOCBP3                           BANKMASK(IOCBP), 3
#define IOCBP4                           BANKMASK(IOCBP), 4
#define IOCBP5                           BANKMASK(IOCBP), 5
#define IOCBP6                           BANKMASK(IOCBP), 6
#define IOCBP7                           BANKMASK(IOCBP), 7
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
#define IRCF0                            BANKMASK(OSCCON), 3
#define IRCF1                            BANKMASK(OSCCON), 4
#define IRCF2                            BANKMASK(OSCCON), 5
#define IRCF3                            BANKMASK(OSCCON), 6
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA3                            BANKMASK(LATA), 3
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATA6                            BANKMASK(LATA), 6
#define LATA7                            BANKMASK(LATA), 7
#define LATB0                            BANKMASK(LATB), 0
#define LATB1                            BANKMASK(LATB), 1
#define LATB2                            BANKMASK(LATB), 2
#define LATB3                            BANKMASK(LATB), 3
#define LATB4                            BANKMASK(LATB), 4
#define LATB5                            BANKMASK(LATB), 5
#define LATB6                            BANKMASK(LATB), 6
#define LATB7                            BANKMASK(LATB), 7
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LATC6                            BANKMASK(LATC), 6
#define LATC7                            BANKMASK(LATC), 7
#define LAT_ICDCLK                       BANKMASK(ICDIO), 4
#define LAT_ICDDAT                       BANKMASK(ICDIO), 5
#define LFIOFR                           BANKMASK(OSCSTAT), 1
#define LWLO                             BANKMASK(PMCON1), 5
#define OERR                             BANKMASK(RCSTA), 1
#define P1TSEL                           BANKMASK(PWMTMRS), 0
#define P2TSEL                           BANKMASK(PWMTMRS), 2
#define PEIE                             BANKMASK(INTCON), 6
#define PLLSR                            BANKMASK(OSCSTAT), 6
#define PORT_ICDCLK                      BANKMASK(ICDIO), 6
#define PORT_ICDDAT                      BANKMASK(ICDIO), 7
#define PS0                              BANKMASK(OPTION_REG), 0
#define PS1                              BANKMASK(OPTION_REG), 1
#define PS2                              BANKMASK(OPTION_REG), 2
#define PSA                              BANKMASK(OPTION_REG), 3
#define PWM1DCH0                         BANKMASK(PWM1DCH), 0
#define PWM1DCH1                         BANKMASK(PWM1DCH), 1
#define PWM1DCH2                         BANKMASK(PWM1DCH), 2
#define PWM1DCH3                         BANKMASK(PWM1DCH), 3
#define PWM1DCH4                         BANKMASK(PWM1DCH), 4
#define PWM1DCH5                         BANKMASK(PWM1DCH), 5
#define PWM1DCH6                         BANKMASK(PWM1DCH), 6
#define PWM1DCH7                         BANKMASK(PWM1DCH), 7
#define PWM1DCL0                         BANKMASK(PWM1DCL), 6
#define PWM1DCL1                         BANKMASK(PWM1DCL), 7
#define PWM1EN                           BANKMASK(PWM1CON), 7
#define PWM1OE                           BANKMASK(PWM1CON), 6
#define PWM1OE0                          BANKMASK(PWM1AOE), 0
#define PWM1OE1                          BANKMASK(PWM1AOE), 1
#define PWM1OE2                          BANKMASK(PWM1AOE), 2
#define PWM1OE3                          BANKMASK(PWM1AOE), 3
#define PWM1OUT                          BANKMASK(PWM1CON), 5
#define PWM1POL                          BANKMASK(PWM1CON), 4
#define PWM2DCH0                         BANKMASK(PWM2DCH), 0
#define PWM2DCH1                         BANKMASK(PWM2DCH), 1
#define PWM2DCH2                         BANKMASK(PWM2DCH), 2
#define PWM2DCH3                         BANKMASK(PWM2DCH), 3
#define PWM2DCH4                         BANKMASK(PWM2DCH), 4
#define PWM2DCH5                         BANKMASK(PWM2DCH), 5
#define PWM2DCH6                         BANKMASK(PWM2DCH), 6
#define PWM2DCH7                         BANKMASK(PWM2DCH), 7
#define PWM2DCL0                         BANKMASK(PWM2DCL), 6
#define PWM2DCL1                         BANKMASK(PWM2DCL), 7
#define PWM2EN                           BANKMASK(PWM2CON), 7
#define PWM2OE                           BANKMASK(PWM2CON), 6
#define PWM2OE0                          BANKMASK(PWM2AOE), 0
#define PWM2OE1                          BANKMASK(PWM2AOE), 1
#define PWM2OE2                          BANKMASK(PWM2AOE), 2
#define PWM2OE3                          BANKMASK(PWM2AOE), 3
#define PWM2OUT                          BANKMASK(PWM2CON), 5
#define PWM2POL                          BANKMASK(PWM2CON), 4
#define RA0                              BANKMASK(PORTA), 0
#define RA1                              BANKMASK(PORTA), 1
#define RA2                              BANKMASK(PORTA), 2
#define RA3                              BANKMASK(PORTA), 3
#define RA4                              BANKMASK(PORTA), 4
#define RA5                              BANKMASK(PORTA), 5
#define RA6                              BANKMASK(PORTA), 6
#define RA7                              BANKMASK(PORTA), 7
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RB6                              BANKMASK(PORTB), 6
#define RB7                              BANKMASK(PORTB), 7
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define RC6                              BANKMASK(PORTC), 6
#define RC7                              BANKMASK(PORTC), 7
#define RCIDL                            BANKMASK(BAUDCON), 6
#define RCIE                             BANKMASK(PIE1), 5
#define RCIF                             BANKMASK(PIR1), 5
#define RD                               BANKMASK(PMCON1), 0
#define RE3                              BANKMASK(PORTE), 3
#define RSTVEC                           BANKMASK(ICDCON0), 0
#define RX9                              BANKMASK(RCSTA), 6
#define RX9D                             BANKMASK(RCSTA), 0
#define S1ILS                            BANKMASK(SSPLVL), 0
#define S2ILS                            BANKMASK(SSPLVL), 4
#define SBOREN                           BANKMASK(BORCON), 7
#define SCKP                             BANKMASK(BAUDCON), 4
#define SCS0                             BANKMASK(OSCCON), 0
#define SCS1                             BANKMASK(OSCCON), 1
#define SENDB                            BANKMASK(TXSTA), 3
#define SPEN                             BANKMASK(RCSTA), 7
#define SPLLEN                           BANKMASK(OSCCON), 7
#define SREN                             BANKMASK(RCSTA), 5
#define SSP1ADD0                         BANKMASK(SSP1ADD), 0
#define SSP1ADD1                         BANKMASK(SSP1ADD), 1
#define SSP1ADD2                         BANKMASK(SSP1ADD), 2
#define SSP1ADD3                         BANKMASK(SSP1ADD), 3
#define SSP1ADD4                         BANKMASK(SSP1ADD), 4
#define SSP1ADD5                         BANKMASK(SSP1ADD), 5
#define SSP1ADD6                         BANKMASK(SSP1ADD), 6
#define SSP1ADD7                         BANKMASK(SSP1ADD), 7
#define SSP1BUF0                         BANKMASK(SSP1BUF), 0
#define SSP1BUF1                         BANKMASK(SSP1BUF), 1
#define SSP1BUF2                         BANKMASK(SSP1BUF), 2
#define SSP1BUF3                         BANKMASK(SSP1BUF), 3
#define SSP1BUF4                         BANKMASK(SSP1BUF), 4
#define SSP1BUF5                         BANKMASK(SSP1BUF), 5
#define SSP1BUF6                         BANKMASK(SSP1BUF), 6
#define SSP1BUF7                         BANKMASK(SSP1BUF), 7
#define SSP1IE                           BANKMASK(PIE1), 3
#define SSP1IF                           BANKMASK(PIR1), 3
#define SSP1MSK0                         BANKMASK(SSP1MSK), 0
#define SSP1MSK1                         BANKMASK(SSP1MSK), 1
#define SSP1MSK2                         BANKMASK(SSP1MSK), 2
#define SSP1MSK3                         BANKMASK(SSP1MSK), 3
#define SSP1MSK4                         BANKMASK(SSP1MSK), 4
#define SSP1MSK5                         BANKMASK(SSP1MSK), 5
#define SSP1MSK6                         BANKMASK(SSP1MSK), 6
#define SSP1MSK7                         BANKMASK(SSP1MSK), 7
#define SSP2ADD0                         BANKMASK(SSP2ADD), 0
#define SSP2ADD1                         BANKMASK(SSP2ADD), 1
#define SSP2ADD2                         BANKMASK(SSP2ADD), 2
#define SSP2ADD3                         BANKMASK(SSP2ADD), 3
#define SSP2ADD4                         BANKMASK(SSP2ADD), 4
#define SSP2ADD5                         BANKMASK(SSP2ADD), 5
#define SSP2ADD6                         BANKMASK(SSP2ADD), 6
#define SSP2ADD7                         BANKMASK(SSP2ADD), 7
#define SSP2BUF0                         BANKMASK(SSP2BUF), 0
#define SSP2BUF1                         BANKMASK(SSP2BUF), 1
#define SSP2BUF2                         BANKMASK(SSP2BUF), 2
#define SSP2BUF3                         BANKMASK(SSP2BUF), 3
#define SSP2BUF4                         BANKMASK(SSP2BUF), 4
#define SSP2BUF5                         BANKMASK(SSP2BUF), 5
#define SSP2BUF6                         BANKMASK(SSP2BUF), 6
#define SSP2BUF7                         BANKMASK(SSP2BUF), 7
#define SSP2IE                           BANKMASK(PIE1), 2
#define SSP2IF                           BANKMASK(PIR1), 2
#define SSP2MSK0                         BANKMASK(SSP2MSK), 0
#define SSP2MSK1                         BANKMASK(SSP2MSK), 1
#define SSP2MSK2                         BANKMASK(SSP2MSK), 2
#define SSP2MSK3                         BANKMASK(SSP2MSK), 3
#define SSP2MSK4                         BANKMASK(SSP2MSK), 4
#define SSP2MSK5                         BANKMASK(SSP2MSK), 5
#define SSP2MSK6                         BANKMASK(SSP2MSK), 6
#define SSP2MSK7                         BANKMASK(SSP2MSK), 7
#define SSPIE                            BANKMASK(PIE1), 3
#define SSSEL                            BANKMASK(APFCON), 5
#define SSTEP                            BANKMASK(ICDCON0), 5
#define STKOVF                           BANKMASK(PCON), 7
#define STKUNF                           BANKMASK(PCON), 6
#define SWDTEN                           BANKMASK(WDTCON), 0
#define SYNC                             BANKMASK(TXSTA), 4
#define T0CS                             BANKMASK(OPTION_REG), 5
#define T0IE                             BANKMASK(INTCON), 5
#define T0IF                             BANKMASK(INTCON), 2
#define T0SE                             BANKMASK(OPTION_REG), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS                            BANKMASK(T1GCON), 0
#define T1GSS0                           BANKMASK(T1GCON), 0
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T2CKPS0                          BANKMASK(T2CON), 0
#define T2CKPS1                          BANKMASK(T2CON), 1
